platformio/platform-ststm32/misc/svd/STM32C031.svd
        <register>
          <name>SYSCFG_ITLINE4</name>
          <displayName>SYSCFG_ITLINE4</displayName>
          <description>SYSCFG interrupt line 4 status register </description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RCC</name>
              <description>Reset and clock control interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE5</name>
          <displayName>SYSCFG_ITLINE5</displayName>
          <description>SYSCFG interrupt line 5 status register </description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI line 0 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI line 1 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE6</name>
          <displayName>SYSCFG_ITLINE6</displayName>
          <description>SYSCFG interrupt line 6 status register </description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI2</name>
              <description>EXTI line 2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI line 3 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE7</name>
          <displayName>SYSCFG_ITLINE7</displayName>
          <description>SYSCFG interrupt line 7 status register </description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI line 4 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI line 5 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI line 6 interrupt request pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI line 7 interrupt request pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI8</name>
              <description>EXTI line 8 interrupt request pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI line 9 interrupt request pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI line 10 interrupt request pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI line 11 interrupt request pending</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI12</name>
              <description>EXTI line 12 interrupt request pending</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI line 13 interrupt request pending</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI line 14 interrupt request pending</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI line 15 interrupt request pending</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE9</name>
          <displayName>SYSCFG_ITLINE9</displayName>
          <description>SYSCFG interrupt line 9 status register </description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA1_CH1</name>
              <description>DMA1 channel 1interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE10</name>
          <displayName>SYSCFG_ITLINE10</displayName>
          <description>SYSCFG interrupt line 10 status register </description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA1_CH2</name>
              <description>DMA1 channel 2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA1_CH3</name>
              <description>DMA1 channel 3 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE11</name>
          <displayName>SYSCFG_ITLINE11</displayName>
          <description>SYSCFG interrupt line 11 status register </description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAMUX</name>
              <description>DMAMUX interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE12</name>
          <displayName>SYSCFG_ITLINE12</displayName>
          <description>SYSCFG interrupt line 12 status register </description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC</name>
              <description>ADC interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE13</name>
          <displayName>SYSCFG_ITLINE13</displayName>
          <description>SYSCFG interrupt line 13 status register </description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM1_CCU</name>
              <description>Timer 1 commutation interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_TRG</name>
              <description>Timer 1 trigger interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_UPD</name>
              <description>Timer 1 update interrupt request pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_BRK</name>
              <description>Timer 1 break interrupt request pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE14</name>
          <displayName>SYSCFG_ITLINE14</displayName>
          <description>SYSCFG interrupt line 14 status register </description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM1_CC</name>
              <description>Timer 1 capture compare interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE16</name>
          <displayName>SYSCFG_ITLINE16</displayName>
          <description>SYSCFG interrupt line 16 status register </description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM3</name>
              <description>Timer 3 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE19</name>
          <displayName>SYSCFG_ITLINE19</displayName>
          <description>SYSCFG interrupt line 19 status register </description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM14</name>
              <description>Timer 14 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE21</name>
          <displayName>SYSCFG_ITLINE21</displayName>
          <description>SYSCFG interrupt line 21 status register </description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM16</name>
              <description>Timer 16 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE22</name>
          <displayName>SYSCFG_ITLINE22</displayName>
          <description>SYSCFG interrupt line 22 status register </description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM17</name>
              <description>Timer 17 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE23</name>
          <displayName>SYSCFG_ITLINE23</displayName>
          <description>SYSCFG interrupt line 23 status register </description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I2C1</name>
              <description>I2C1 interrupt request pending, combined with EXTI line 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE25</name>
          <displayName>SYSCFG_ITLINE25</displayName>
          <description>SYSCFG interrupt line 25 status register </description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPI1</name>
              <description>SPI1 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE27</name>
          <displayName>SYSCFG_ITLINE27</displayName>
          <description>SYSCFG interrupt line 27 status register </description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USART1</name>
              <description>USART1 interrupt request pending, combined with EXTI line 25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE28</name>
          <displayName>SYSCFG_ITLINE28</displayName>
          <description>SYSCFG interrupt line 28 status register </description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USART2</name>
              <description>USART2 interrupt request pending (EXTI line 26)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
